{
  "about": {
    "text": "My name is MD Islam, and software engineering is my passion and my career goal. Ever since I was a young child, I have wanted to pursue software development and I realized I could do it with Computer Science. When I become inspired to create a software project, I commit to it and try to develop a MVP (see projects section). When I’m not coding, I enjoy reading light novels, watching anime, and TV shows.",
    "img": "selfie.jpg",
    "stacks": ["Python", "JavaScript", "Django/Flask", "MEAN", "Java", "Android", "C/C++", "Git/Mercurial"],
    "college": "The City College of New York",
    "major": "Computer Science",
    "degree": "Bachelors of Science (Expected May 2017)"
  },

  "projects": [
    {
      "title": "Web Novel Scraper",
      "snippet": "A scraper tool to grab contents of chapters of a light novel and store them as HTML files to read later. The script utilizes Readability, with a fallback of grabbing the content-div, to grab relevant text from a website and ebooklib to generate a ePub if necessary.",
      "stacks": ["Flask", "Celery", "AngularJS", "Bootstrap"],
      "img": "lightnovelscrapper.gif",
      "repo": "https://github.com/exp0nge/light-novel-scraper",
      "web": "https://novel-scraper.azurewebsites.net"
    },
    {
      "title": "Break Bread",
      "snippet": "A software reengineering of the original Break Bread with Friends. The original project was developed as a course long project for Web Site Design at The City College of New York and used Django. This implementation envisions the project with MongoDB, Express, and Node.js.",
      "stacks": ["MongoDB", "Express", "Node.js", "Bootstrap"],
      "img": "breakbread.gif",
      "repo": "https://github.com/exp0nge/break-bread-node"
    },

    {
      "title": "Mount Sinai PAIR",
      "snippet": "Semester long project for Web Site Design at The City College of New York and was developed for Mount Sinai. This Django app allowed researchers to recruit students for research projects by allowing researchers to post their projects and the specifications for the project. Students would then be able to browse all the projects, made available with Haystack and Whoosh. The app allowed rapid prototyping facilities to monitor both sides of the discussion in the application process for a student and researcher through a customized Django admin panel.",
      "stacks": ["Django", "Materialize"],
      "img": "mountsinai.jpg",
      "repo": "https://bitbucket.org/mdislamwork/mountsinaipair-dev"
    },
    {
      "title": "Series Tracker",
      "snippet": "An app to keep track of various series (TV shows, manga, anime, etc). Created over summer 2015 in an effort to learn web development with Django.",
      "stacks": ["Django", "AngularJS", "Materialize"],
      "img": "seriestracker.gif",
      "repo": "https://github.com/exp0nge/series-tracker-dev",
      "web": "https://series-tracker.azurewebsites.net"
    },
    {
      "title": "Bitcoin Piggy Bank",
      "snippet": "The idea was formulated during NYU Leslie eLab Hackathon which called for Bitcoin themed hacks. I was given the idea to create something that is similar to the conventional piggy banks we grew up with. Instead of using real piggy banks, we replace it with virtual or a physical representation of it. Instead of real money, we use bitcoin. This allows people to learn about and use bitcoin. I mostly used Blockchain's API to utilize most of the funtionality for this project.",
      "stacks": ["Python"],
      "img": "btcpiggy.png",
      "repo": "https://github.com/exp0nge/bitcoin-piggy-bank"
    },
    {
      "title": "P2PBooks",
      "snippet": "This repository is for Jie Wei's CSc 322, Software Engineering class at The City College of New York, which is to design and implement a private book sharing system. The goal of the project was to learn the software development cycle. The full spec sheet, design report and the SRS report are included in the 1.0.0 release (repo).",
      "stacks": ["Python", "PySide"],
      "img": "p2pbooks.gif",
      "repo": "https://github.com/psuong/P2PBooks"
    }
  ],

  "experiences": [
    {
      "company": "appFigures",
      "img": "appfigures.png",
      "dates": "January 2017 -",
      "position": "Back End Developer",
      "text": ""
    },
    {
      "company": "Gleam",
      "img": "gleam.jpg",
      "dates": "January 2016 - January 2017",
      "position": "Software Developer",
      "text": "Developed and maintained chat, data visualization, task, journal, and note management system for patient and therapist views. Semi-finalists in the Zahn Innovation Competition and part of the summer accelerator 2016 cohort."
    },
    {
      "company": "JPMorgan Chase & Co.",
      "img": "jp.jpg",
      "dates": "June 2016 - August 2016",
      "position": "Technology Analyst Intern",
      "text": ""
    },
    {
      "company": "Los Alamos National Laboratory",
      "img": "losalamos.jpg",
      "dates": "June 2015 - August 2015",
      "position": "Software Developer Intern",
      "text": "Used PySide to create a cross-platform GUI to leverage pre-existing code, and make it more appealing to use. Redesigned the software’s website to be more modern, and dynamic. "
    },
    {
      "company": "The City College of New York",
      "img": "ccny.jpg",
      "dates": "August 2013 - Current",
      "position": "Admissions Ambassador",
      "text": "Facilitate general campus tours. Attend off-campus recruitment events. Keep large scale on-campus events (e.g. Open House) organized."
    }
  ],

  "contact": [
    {
      "img": "github.png",
      "link": "https://github.com/exp0nge",
      "alt": "GitHub logo provided by https://www.iconfinder.com/Abdulsamadammar"
    },
    {
      "img": "linkedin.png",
      "link": "https://www.linkedin.com/in/mdislamr",
      "alt": "LinkedIn logo provided by https://www.iconfinder.com/Abdulsamadammar"
    }
  ]
}
